<a href="https://colab.research.google.com/github/ArnavPabby/ds1002-ncn6dt/blob/main/homework/week-13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - Week 13

Complete the following blocks as specified in the directions. Run each cell to return the desired output. Save your notebook back to your GitHub repository and submit the GitHub URL to your notebook for review.

## 1. Change Runtime to R (1 pt)

Change the runtime of this notebook to R. You can verify that you are running R by displaying the current version you are running. Run the cell below and show the output.

In [1]:
version

               _
platform       x86_64-pc-linux-gnu
arch           x86_64
os             linux-gnu
system         x86_64, linux-gnu
status
major          4
minor          3.2
year           2023
month          10
day            31
svn rev        85441
language       R
version.string R version 4.3.2 (2023-10-31)
nickname       Eye Holes

## 2. Create Vectors (2 pts)

Create two vectors in the cells below, according to the prompts given.

In [2]:
# create a vector with 7 integer values. Assign it to a variable named "my_integers"
my_integers <- c(1,2,3,4,5,6,7)

In [3]:
var1 = 8
var2 = 4
var3 = 12
var4 = 25

# Using the variables given above, assign three new variables the following calculated values:
#
# 1. Your first variable should be assigned the calculated value of var2 divided by var1.
val5 <- var2/var1
print(val5)
# 2. Your second variable should be assigned the calculated value of var2 cubed times var3.
val6 <- (var2**3)*var3
print(val6)
# 3. Your third variable should be assigned the calculated value of var4 integer divided by var3.
val7 <- as.integer(var4/var3)
print(val7)
# Next, create an array populated by your three variables. Assign the array to a new variable named "my_calculated_values"
my_calculated_values <- c(val5, val6, val7)
print(my_calculated_values)

[1] 0.5
[1] 768
[1] 2
[1]   0.5 768.0   2.0

## 3. Vector Indexes (3 pts)

In the cell below, create a vector that starts with the integer 4, that increments by counts of 3 all the way to 28.

Assign the vector to a variable name.

In [4]:
my_vector <- seq(4, 28, by = 3)
print(my_vector)

[1]  4  7 10 13 16 19 22 25 28

Next, show how to display this vector with the 3 index removed.

In [5]:
my_vector[-3]

[1]  4  7 13 16 19 22 25 28

Finally, show how to delete the 4th, 5th, and 7th indexes from the vector and update the vector so they are forever removed from the vector.

Hint: there is a fairly simple way to do this in one line, such that you don't have to run a separate command for each removal.

In [6]:
my_vector = my_vector[-c(4,5,7)]
my_vector

[1]  4  7 10 19 25 28

## 4. Create a Data Frame (3 pts)

In the cell below create a data frame with 10 observations (rows) and 5 variables (columns) each. This data frame will describe some of your favorite musical performers. You can use real or fictitious data to populate your data frame.

Variables:
  - `artist` - Artist or band name
  - `category` - Rock, Pop, Country, Hip-hop, Jazz, Classical, Soul, Other. (Try to distribute your selections here)
  - `size` - (number of members, 1-?)
  - `start` - Debut year of artist.
  - `grammy` - Grammmy winner? `TRUE` | `FALSE`

First create vectors for each variable populated with your own performer data. Then create a data frame from these vectors (be sure to assign column names too) and assign it to a named variable such as `df`.

In [7]:
artist <- c("A", "B", "C",
           "D", "E", "F",
           "G", "H", "I", "J")

category <- c("rock", "pop", "country",
                "hip hop", "jazz", "classical",
                "soul", "rock", "pop", "jazz")

size <- c(1,1,1,2,3,4,5,3,5,6)

start <- c(2000,2001,2002,2003,2004,2005,2006,2007,2008,2009)

grammy <- c(FALSE, FALSE, TRUE, FALSE, TRUE, TRUE, FALSE, FALSE, FALSE, TRUE)

df <- data.frame(Artist = artist, Category = category, Size = size, Start = start, Grammy = grammy)
df

   Artist Category  Size Start Grammy
1  A      rock      1    2000  FALSE
2  B      pop       1    2001  FALSE
3  C      country   1    2002   TRUE
4  D      hip hop   2    2003  FALSE
5  E      jazz      3    2004   TRUE
6  F      classical 4    2005   TRUE
7  G      soul      5    2006  FALSE
8  H      rock      3    2007  FALSE
9  I      pop       5    2008  FALSE
10 J      jazz      6    2009   TRUE

## 5. Filter/Query a Data Frame (2 pts)

Use the data frame you created above and show how to perform the following queries.

In [8]:
# Display the first 3 records and only the `artist`, `category` and `grammy` columns for each.
df[1:3,c("Artist", "Category", "Grammy")]

  Artist Category Grammy
1 A      rock     FALSE
2 B      pop      FALSE
3 C      country   TRUE

In [9]:
# Display the records for just one musical category, such as only Rock bands or only Hip-hop bands.
df[df$Category == "rock",]

  Artist Category Size Start Grammy
1 A      rock     1    2000  FALSE
8 H      rock     3    2007  FALSE

## Query a Data Frame using `tidyverse` (4 pts)

1. Show how to load the library.
2. Show how to glimpse basic features of the `starwars` data table.
3. Create a query using tidyverse that retrieves the following data:
    - Selects only these columns: `name`, `height`, `sex`, `species`.
    - Filters for all species that are NOT Human.
    - Arranges the resulting data in order by name.

Show your output in a data frame.

In [16]:
# Installing packages
install.packages("tidyverse")
library(tidyverse)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

In [21]:
starwars %>%
  select(name, height, sex, species) %>%
  filter(species != "Human") %>%
  na.omit()
  arrange(name)

   name                  height sex            species
1  C-3PO                 167    none           Droid
2  R2-D2                  96    none           Droid
3  R5-D4                  97    none           Droid
4  Chewbacca             228    male           Wookiee
5  Greedo                173    male           Rodian
6  Jabba Desilijic Tiure 175    hermaphroditic Hutt
7  Yoda                   66    male           Yoda's species
8  IG-88                 200    none           Droid
9  Bossk                 190    male           Trandoshan
10 Ackbar                180    male           Mon Calamari
11 Wicket Systri Warrick  88    male           Ewok
12 Nien Nunb             160    male           Sullustan
13 Nute Gunray           191    male           Neimodian
14 Jar Jar Binks         196    male           Gungan
15 Roos Tarpals          224    male           Gungan
16 Rugor Nass            206    male           Gungan
17 Watto                 137    male           Toydarian
18 Sebulba               112    male           Dug
19 Darth Maul            175    male           Zabrak
20 Bib Fortuna           180    male           Twi'lek
21 Ayla Secura           178    female         Twi'lek
22 Ratts Tyerel           79    male           Aleena
23 Dud Bolt               94    male           Vulptereen
24 Gasgano               122    male           Xexto
25 Ben Quadinaros        163    male           Toong
26 Ki-Adi-Mundi          198    male           Cerean
27 Kit Fisto             196    male           Nautolan
28 Eeth Koth             171    male           Zabrak
29 Adi Gallia            184    female         Tholothian
30 Saesee Tiin           188    male           Iktotchi
31 Yarael Poof           264    male           Quermian
32 Plo Koon              188    male           Kel Dor
33 Mas Amedda            196    male           Chagrian
34 Poggle the Lesser     183    male           Geonosian
35 Luminara Unduli       170    female         Mirialan
36 Barriss Offee         166    female         Mirialan
37 Zam Wesell            168    female         Clawdite
38 Dexter Jettster       198    male           Besalisk
39 Lama Su               229    male           Kaminoan
40 Taun We               213    female         Kaminoan
41 R4-P17                 96    none           Droid
42 Wat Tambor            193    male           Skakoan
43 San Hill              191    male           Muun
44 Shaak Ti              178    female         Togruta
45 Grievous              216    male           Kaleesh
46 Tarfful               234    male           Wookiee
47 Tion Medon            206    male           Pau'an

ERROR: ignored